'''
Задание: Даны 2 числа a и b. Найдите их сумму, разность и произведение
'''

a = int(input("Введите целое число a = "))
b = int(input("Введите целое число b = "))

summa_task = a + b
difference_task = a - b
product_task = a * b

print(f"Сумма: {summa_task}")
print(f"Разность: {difference_task}")
print(f"Произведение {product_task}")
